// - створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б
// function square(a, b){
//     let res = a*b;
//     return res;
// };
// let reult = square(5, 10);
// console.log(reult);

// - створити функцію яка обчислює та повертає площу круга з радіусом r (S=PIr2)
// function squareCircle(PI,r){
//     let a = 2;
//     let r2 = Math.pow(r, a);
//     let squareCircle = 3.14*r2;
//     return squareCircle;
// };
// console.log(squareCircle(3.14, 5));

// - створити функцію яка обчислює та повертає об*єм циліндру висотою h, та радіутом r
// function squareСylinder(r, h){
//     let a = 2;
//     let r2 = Math.pow(r, a);
//     let squareСylinder = 3.14*r2*h;
//     return squareСylinder;
// };
// console.log(squareСylinder(5, 6));

// - створити функцію яка приймає масив та виводить кожен його елемент










// - створити функцію яка створює параграф з текстом. Текст задати через аргумент
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список
//
// - створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.